---
kind: type
id: T:Autodesk.Revit.DB.ElementType
source: html/ffb18296-0448-559c-580c-7857cbcdc094.htm
---
# Autodesk.Revit.DB.ElementType

Base class for all Types within Autodesk Revit.

## Syntax (C#)
```csharp
public class ElementType : Element
```

## Remarks
Element types are usually non user visible elements that define instances. For example a
 wall type is a type that is not visible until an instance of the wall is created.